reference/original-backend/opt/etas/vaas/vaas_jmeter/test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="JSON 10 Frame Test">
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">300</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Send JSON with 10 Frames">
          <stringProp name="HTTPSampler.domain">192.168.112.18</stringProp>
          <stringProp name="HTTPSampler.port">6678</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/spring/v1/post_AA_car_data</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;data&quot;: [&#xd;
    {&#xd;
      &quot;date&quot;: &quot;2022_04_21_15_41_19_258&quot;,&#xd;
      &quot;sn&quot;: &quot;${sn}&quot;,&#xd;
      &quot;stream_data&quot;: [&#xd;
        {&#xd;
          &quot;name&quot;: &quot;VehicleSpd( Km/h)&quot;,&#xd;
          &quot;value&quot;: &quot;0.016&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;WiperFlag&quot;,&#xd;
          &quot;value&quot;: &quot;Off&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;SteerWheelAngle( deg)&quot;,&#xd;
          &quot;value&quot;: &quot;-2.4&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;LateralAcce( m/s^2)&quot;,&#xd;
          &quot;value&quot;: &quot;0.11&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;LongitudeAcc( m/s^2)&quot;,&#xd;
          &quot;value&quot;: &quot;-0.03&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;FLWheelSpd( Km/h)&quot;,&#xd;
          &quot;value&quot;: &quot;0.0&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;FRWheelSpd( Km/h)&quot;,&#xd;
          &quot;value&quot;: &quot;0.0&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;ESC_Mcylinder_Pressure( bar)&quot;,&#xd;
          &quot;value&quot;: &quot;0.0&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;RLWheelSpd( Km/h)&quot;,&#xd;
          &quot;value&quot;: &quot;0.0&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;RRWheelSpd( Km/h)&quot;,&#xd;
          &quot;value&quot;: &quot;0.0&quot;&#xd;
        }&#xd;
      ]&#xd;
    },&#xd;
    {&#xd;
      &quot;date&quot;: &quot;2022_04_21_15_41_19_343&quot;,&#xd;
      &quot;sn&quot;: &quot;9030076821&quot;,&#xd;
      &quot;stream_data&quot;: [&#xd;
        {&#xd;
          &quot;name&quot;: &quot;VehicleSpd( Km/h)&quot;,&#xd;
          &quot;value&quot;: &quot;0.016&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;WiperFlag&quot;,&#xd;
          &quot;value&quot;: &quot;Off&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;SteerWheelAngle( deg)&quot;,&#xd;
          &quot;value&quot;: &quot;-2.4&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;LateralAcce( m/s^2)&quot;,&#xd;
          &quot;value&quot;: &quot;0.08&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;LongitudeAcc( m/s^2)&quot;,&#xd;
          &quot;value&quot;: &quot;-0.03&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;FLWheelSpd( Km/h)&quot;,&#xd;
          &quot;value&quot;: &quot;0.0&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;FRWheelSpd( Km/h)&quot;,&#xd;
          &quot;value&quot;: &quot;0.0&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;ESC_Mcylinder_Pressure( bar)&quot;,&#xd;
          &quot;value&quot;: &quot;0.0&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;RLWheelSpd( Km/h)&quot;,&#xd;
          &quot;value&quot;: &quot;0.0&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;RRWheelSpd( Km/h)&quot;,&#xd;
          &quot;value&quot;: &quot;0.0&quot;&#xd;
        }&#xd;
      ]&#xd;
    },&#xd;
    {&#xd;
      &quot;date&quot;: &quot;2022_04_21_15_41_19_438&quot;,&#xd;
      &quot;sn&quot;: &quot;9030076821&quot;,&#xd;
      &quot;stream_data&quot;: [&#xd;
        {&#xd;
          &quot;name&quot;: &quot;VehicleSpd( Km/h)&quot;,&#xd;
          &quot;value&quot;: &quot;0.016&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;WiperFlag&quot;,&#xd;
          &quot;value&quot;: &quot;Off&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;SteerWheelAngle( deg)&quot;,&#xd;
          &quot;value&quot;: &quot;-2.4&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;LateralAcce( m/s^2)&quot;,&#xd;
          &quot;value&quot;: &quot;0.08&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;LongitudeAcc( m/s^2)&quot;,&#xd;
          &quot;value&quot;: &quot;-0.05&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;FLWheelSpd( Km/h)&quot;,&#xd;
          &quot;value&quot;: &quot;0.0&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;FRWheelSpd( Km/h)&quot;,&#xd;
          &quot;value&quot;: &quot;0.0&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;ESC_Mcylinder_Pressure( bar)&quot;,&#xd;
          &quot;value&quot;: &quot;0.0&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;RLWheelSpd( Km/h)&quot;,&#xd;
          &quot;value&quot;: &quot;0.0&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;RRWheelSpd( Km/h)&quot;,&#xd;
          &quot;value&quot;: &quot;0.0&quot;&#xd;
        }&#xd;
      ]&#xd;
    },&#xd;
    {&#xd;
      &quot;date&quot;: &quot;2022_04_21_15_41_19_534&quot;,&#xd;
      &quot;sn&quot;: &quot;9030076821&quot;,&#xd;
      &quot;stream_data&quot;: [&#xd;
        {&#xd;
          &quot;name&quot;: &quot;VehicleSpd( Km/h)&quot;,&#xd;
          &quot;value&quot;: &quot;0.016&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;WiperFlag&quot;,&#xd;
          &quot;value&quot;: &quot;Off&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;SteerWheelAngle( deg)&quot;,&#xd;
          &quot;value&quot;: &quot;-2.4&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;LateralAcce( m/s^2)&quot;,&#xd;
          &quot;value&quot;: &quot;0.08&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;LongitudeAcc( m/s^2)&quot;,&#xd;
          &quot;value&quot;: &quot;-0.03&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;FLWheelSpd( Km/h)&quot;,&#xd;
          &quot;value&quot;: &quot;0.0&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;FRWheelSpd( Km/h)&quot;,&#xd;
          &quot;value&quot;: &quot;0.0&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;ESC_Mcylinder_Pressure( bar)&quot;,&#xd;
          &quot;value&quot;: &quot;0.03&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;RLWheelSpd( Km/h)&quot;,&#xd;
          &quot;value&quot;: &quot;0.0&quot;&#xd;
        },&#xd;
        {&#xd;
          &quot;name&quot;: &quot;RRWheelSpd( Km/h)&quot;,&#xd;
          &quot;value&quot;: &quot;0.0&quot;&#xd;
        }&#xd;
      ]&#xd;
    }&#xd;
  ],&#xd;
  &quot;packageSize&quot;: 4,&#xd;
  &quot;received_at&quot;: &quot;2022-04-21 15:41:28.040801&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config">
        <stringProp name="delimiter">,</stringProp>
        <stringProp name="fileEncoding">UTF-8</stringProp>
	<stringProp name="filename">/opt/etas/vaas/vaas_jmeter/random_numbers.csv</stringProp>
        <boolProp name="ignoreFirstLine">true</boolProp>
        <boolProp name="quotedData">false</boolProp>
        <boolProp name="recycle">true</boolProp>
        <stringProp name="shareMode">shareMode.all</stringProp>
        <boolProp name="stopThread">false</boolProp>
        <stringProp name="variableNames">sn</stringProp>
      </CSVDataSet>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>